MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048EFH124/mcu.h
extern volatile __ADCDATA31bits_t ADCDATA31bits __asm__ ("ADCDATA31") __attribute__((section("sfrs"), address(0xBF84B27C)));
#define ADCDATA32 ADCDATA32
extern volatile uint32_t   ADCDATA32 __attribute__((section("sfrs"), address(0xBF84B280)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA32bits_t;
extern volatile __ADCDATA32bits_t ADCDATA32bits __asm__ ("ADCDATA32") __attribute__((section("sfrs"), address(0xBF84B280)));
#define ADCDATA33 ADCDATA33
extern volatile uint32_t   ADCDATA33 __attribute__((section("sfrs"), address(0xBF84B284)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA33bits_t;
extern volatile __ADCDATA33bits_t ADCDATA33bits __asm__ ("ADCDATA33") __attribute__((section("sfrs"), address(0xBF84B284)));
#define ADCDATA34 ADCDATA34
extern volatile uint32_t   ADCDATA34 __attribute__((section("sfrs"), address(0xBF84B288)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA34bits_t;
extern volatile __ADCDATA34bits_t ADCDATA34bits __asm__ ("ADCDATA34") __attribute__((section("sfrs"), address(0xBF84B288)));
#define ADCDATA35 ADCDATA35
extern volatile uint32_t   ADCDATA35 __attribute__((section("sfrs"), address(0xBF84B28C)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA35bits_t;
extern volatile __ADCDATA35bits_t ADCDATA35bits __asm__ ("ADCDATA35") __attribute__((section("sfrs"), address(0xBF84B28C)));
#define ADCDATA36 ADCDATA36
extern volatile uint32_t   ADCDATA36 __attribute__((section("sfrs"), address(0xBF84B290)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA36bits_t;
extern volatile __ADCDATA36bits_t ADCDATA36bits __asm__ ("ADCDATA36") __attribute__((section("sfrs"), address(0xBF84B290)));
#define ADCDATA37 ADCDATA37
extern volatile uint32_t   ADCDATA37 __attribute__((section("sfrs"), address(0xBF84B294)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA37bits_t;
extern volatile __ADCDATA37bits_t ADCDATA37bits __asm__ ("ADCDATA37") __attribute__((section("sfrs"), address(0xBF84B294)));
#define ADCDATA38 ADCDATA38
extern volatile uint32_t   ADCDATA38 __attribute__((section("sfrs"), address(0xBF84B298)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA38bits_t;
extern volatile __ADCDATA38bits_t ADCDATA38bits __asm__ ("ADCDATA38") __attribute__((section("sfrs"), address(0xBF84B298)));
#define ADCDATA39 ADCDATA39
extern volatile uint32_t   ADCDATA39 __attribute__((section("sfrs"), address(0xBF84B29C)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA39bits_t;
extern volatile __ADCDATA39bits_t ADCDATA39bits __asm__ ("ADCDATA39") __attribute__((section("sfrs"), address(0xBF84B29C)));
#define ADCDATA40 ADCDATA40
extern volatile uint32_t   ADCDATA40 __attribute__((section("sfrs"), address(0xBF84B2A0)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA40bits_t;
extern volatile __ADCDATA40bits_t ADCDATA40bits __asm__ ("ADCDATA40") __attribute__((section("sfrs"), address(0xBF84B2A0)));
#define ADCDATA41 ADCDATA41
extern volatile uint32_t   ADCDATA41 __attribute__((section("sfrs"), address(0xBF84B2A4)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA41bits_t;
extern volatile __ADCDATA41bits_t ADCDATA41bits __asm__ ("ADCDATA41") __attribute__((section("sfrs"), address(0xBF84B2A4)));
#define ADCDATA42 ADCDATA42
extern volatile uint32_t   ADCDATA42 __attribute__((section("sfrs"), address(0xBF84B2A8)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA42bits_t;
extern volatile __ADCDATA42bits_t ADCDATA42bits __asm__ ("ADCDATA42") __attribute__((section("sfrs"), address(0xBF84B2A8)));
#define ADCDATA43 ADCDATA43
extern volatile uint32_t   ADCDATA43 __attribute__((section("sfrs"), address(0xBF84B2AC)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA43bits_t;
extern volatile __ADCDATA43bits_t ADCDATA43bits __asm__ ("ADCDATA43") __attribute__((section("sfrs"), address(0xBF84B2AC)));
#define ADCDATA44 ADCDATA44
extern volatile uint32_t   ADCDATA44 __attribute__((section("sfrs"), address(0xBF84B2B0)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA44bits_t;
extern volatile __ADCDATA44bits_t ADCDATA44bits __asm__ ("ADCDATA44") __attribute__((section("sfrs"), address(0xBF84B2B0)));
#define CM1CON CM1CON
extern volatile uint32_t   CM1CON __attribute__((section("sfrs"), address(0xBF84C000)));
typedef union {
  struct {
    uint32_t CCH:2;
    uint32_t :2;
    uint32_t CREF:1;
    uint32_t :1;
    uint32_t EVPOL:2;
    uint32_t COUT:1;
    uint32_t :4;
    uint32_t CPOL:1;
    uint32_t COE:1;
    uint32_t ON:1;
  };
  struct {
    uint32_t CCH0:1;
    uint32_t CCH1:1;
    uint32_t :4;
    uint32_t EVPOL0:1;
    uint32_t EVPOL1:1;
  };
  struct {
    uint32_t w:32;
  };
} __CM1CONbits_t;
extern volatile __CM1CONbits_t CM1CONbits __asm__ ("CM1CON") __attribute__((section("sfrs"), address(0xBF84C000)));
extern volatile uint32_t        CM1CONCLR __attribute__((section("sfrs"),address(0xBF84C004)));
extern volatile uint32_t        CM1CONSET __attribute__((section("sfrs"),address(0xBF84C008)));
extern volatile uint32_t        CM1CONINV __attribute__((section("sfrs"),address(0xBF84C00C)));
#define CM2CON CM2CON
extern volatile uint32_t   CM2CON __attribute__((section("sfrs"), address(0xBF84C010)));
typedef union {
  struct {
    uint32_t CCH:2;
    uint32_t :2;
    uint32_t CREF:1;
    uint32_t :1;
    uint32_t EVPOL:2;
    uint32_t COUT:1;
    uint32_t :4;
    uint32_t CPOL:1;
    uint32_t COE:1;
    uint32_t ON:1;
  };
  struct {
    uint32_t CCH0:1;
    uint32_t CCH1:1;
    uint32_t :4;
    uint32_t EVPOL0:1;
    uint32_t EVPOL1:1;
  };
  struct {
    uint32_t w:32;
  };
} __CM2CONbits_t;
extern volatile __CM2CONbits_t CM2CONbits __asm__ ("CM2CON") __attribute__((section("sfrs"), address(0xBF84C010)));
extern volatile uint32_t        CM2CONCLR __attribute__((section("sfrs"),address(0xBF84C014)));
extern volatile uint32_t        CM2CONSET __attribute__((section("sfrs"),address(0xBF84C018)));
extern volatile uint32_t        CM2CONINV __attribute__((section("sfrs"),address(0xBF84C01C)));
#define CMSTAT CMSTAT
extern volatile uint32_t   CMSTAT __attribute__((section("sfrs"), address(0xBF84C060)));
typedef union {
  struct {
    uint32_t C1OUT:1;
    uint32_t C2OUT:1;
    uint32_t :11;
    uint32_t SIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __CMSTATbits_t;
