MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048EFH124/mcu.h
extern volatile __USBHWVERbits_t USBHWVERbits __asm__ ("USBHWVER") __attribute__((section("sfrs"), address(0xBF8E306C)));
#define USBINFO USBINFO
extern volatile uint32_t   USBINFO __attribute__((section("sfrs"), address(0xBF8E3078)));
typedef struct {
  uint32_t TXENDPTS:4;
  uint32_t RXENDPTS:4;
  uint32_t RAMBITS:4;
  uint32_t DMACHANS:4;
  uint32_t WTID:4;
  uint32_t WTCON:4;
  uint32_t VPLEN:8;
} __USBINFObits_t;
extern volatile __USBINFObits_t USBINFObits __asm__ ("USBINFO") __attribute__((section("sfrs"), address(0xBF8E3078)));
#define USBEOFRST USBEOFRST
extern volatile uint32_t   USBEOFRST __attribute__((section("sfrs"), address(0xBF8E307C)));
typedef union {
  struct {
    uint32_t HSEOF:8;
    uint32_t FSEOF:8;
    uint32_t LSEOF:8;
    uint32_t NRST:1;
    uint32_t NRSTX:1;
  };
  struct {
    uint32_t :24;
    uint32_t SOFRST:8;
  };
} __USBEOFRSTbits_t;
extern volatile __USBEOFRSTbits_t USBEOFRSTbits __asm__ ("USBEOFRST") __attribute__((section("sfrs"), address(0xBF8E307C)));
#define USBE0TXA USBE0TXA
extern volatile uint32_t   USBE0TXA __attribute__((section("sfrs"), address(0xBF8E3080)));
typedef struct {
  uint32_t TXFADDR:7;
  uint32_t :9;
  uint32_t TXHUBADD:7;
  uint32_t MULTTRAN:1;
  uint32_t TXHUBPRT:7;
} __USBE0TXAbits_t;
extern volatile __USBE0TXAbits_t USBE0TXAbits __asm__ ("USBE0TXA") __attribute__((section("sfrs"), address(0xBF8E3080)));
#define USBE0RXA USBE0RXA
extern volatile uint32_t   USBE0RXA __attribute__((section("sfrs"), address(0xBF8E3084)));
typedef struct {
  uint32_t :16;
  uint32_t RXHUBADD:7;
  uint32_t MULTTRAN:1;
  uint32_t RXHUBPRT:7;
} __USBE0RXAbits_t;
extern volatile __USBE0RXAbits_t USBE0RXAbits __asm__ ("USBE0RXA") __attribute__((section("sfrs"), address(0xBF8E3084)));
#define USBE1TXA USBE1TXA
extern volatile uint32_t   USBE1TXA __attribute__((section("sfrs"), address(0xBF8E3088)));
typedef struct {
  uint32_t TXFADDR:7;
  uint32_t :9;
  uint32_t TXHUBADD:7;
  uint32_t MULTTRAN:1;
  uint32_t TXHUBPRT:7;
} __USBE1TXAbits_t;
extern volatile __USBE1TXAbits_t USBE1TXAbits __asm__ ("USBE1TXA") __attribute__((section("sfrs"), address(0xBF8E3088)));
#define USBE1RXA USBE1RXA
extern volatile uint32_t   USBE1RXA __attribute__((section("sfrs"), address(0xBF8E308C)));
typedef struct {
  uint32_t RXFADDR:7;
  uint32_t :9;
  uint32_t RXHUBADD:7;
  uint32_t MULTTRAN:1;
  uint32_t RXHUBPRT:7;
} __USBE1RXAbits_t;
extern volatile __USBE1RXAbits_t USBE1RXAbits __asm__ ("USBE1RXA") __attribute__((section("sfrs"), address(0xBF8E308C)));
#define USBE2TXA USBE2TXA
extern volatile uint32_t   USBE2TXA __attribute__((section("sfrs"), address(0xBF8E3090)));
typedef struct {
  uint32_t TXFADDR:7;
  uint32_t :9;
  uint32_t TXHUBADD:7;
  uint32_t MULTTRAN:1;
  uint32_t TXHUBPRT:7;
} __USBE2TXAbits_t;
extern volatile __USBE2TXAbits_t USBE2TXAbits __asm__ ("USBE2TXA") __attribute__((section("sfrs"), address(0xBF8E3090)));
#define USBE2RXA USBE2RXA
extern volatile uint32_t   USBE2RXA __attribute__((section("sfrs"), address(0xBF8E3094)));
typedef struct {
  uint32_t RXFADDR:7;
  uint32_t :9;
  uint32_t RXHUBADD:7;
  uint32_t MULTTRAN:1;
  uint32_t RXHUBPRT:7;
} __USBE2RXAbits_t;
extern volatile __USBE2RXAbits_t USBE2RXAbits __asm__ ("USBE2RXA") __attribute__((section("sfrs"), address(0xBF8E3094)));
#define USBE3TXA USBE3TXA
extern volatile uint32_t   USBE3TXA __attribute__((section("sfrs"), address(0xBF8E3098)));
typedef struct {
  uint32_t TXFADDR:7;
  uint32_t :9;
  uint32_t TXHUBADD:7;
  uint32_t MULTTRAN:1;
  uint32_t TXHUBPRT:7;
} __USBE3TXAbits_t;
extern volatile __USBE3TXAbits_t USBE3TXAbits __asm__ ("USBE3TXA") __attribute__((section("sfrs"), address(0xBF8E3098)));
#define USBE3RXA USBE3RXA
extern volatile uint32_t   USBE3RXA __attribute__((section("sfrs"), address(0xBF8E309C)));
typedef struct {
  uint32_t RXFADDR:7;
  uint32_t :9;
  uint32_t RXHUBADD:7;
  uint32_t MULTTRAN:1;
  uint32_t RXHUBPRT:7;
} __USBE3RXAbits_t;
extern volatile __USBE3RXAbits_t USBE3RXAbits __asm__ ("USBE3RXA") __attribute__((section("sfrs"), address(0xBF8E309C)));
#define USBE4TXA USBE4TXA
extern volatile uint32_t   USBE4TXA __attribute__((section("sfrs"), address(0xBF8E30A0)));
typedef struct {
  uint32_t TXFADDR:7;
  uint32_t :9;
  uint32_t TXHUBADD:7;
  uint32_t MULTTRAN:1;
  uint32_t TXHUBPRT:7;
} __USBE4TXAbits_t;
extern volatile __USBE4TXAbits_t USBE4TXAbits __asm__ ("USBE4TXA") __attribute__((section("sfrs"), address(0xBF8E30A0)));
#define USBE4RXA USBE4RXA
extern volatile uint32_t   USBE4RXA __attribute__((section("sfrs"), address(0xBF8E30A4)));
typedef struct {
  uint32_t RXFADDR:7;
  uint32_t :9;
  uint32_t RXHUBADD:7;
  uint32_t MULTTRAN:1;
  uint32_t RXHUBPRT:7;
} __USBE4RXAbits_t;
extern volatile __USBE4RXAbits_t USBE4RXAbits __asm__ ("USBE4RXA") __attribute__((section("sfrs"), address(0xBF8E30A4)));
#define USBE5TXA USBE5TXA
extern volatile uint32_t   USBE5TXA __attribute__((section("sfrs"), address(0xBF8E30A8)));
typedef struct {
  uint32_t TXFADDR:7;
  uint32_t :9;
  uint32_t TXHUBADD:7;
  uint32_t MULTTRAN:1;
  uint32_t TXHUBPRT:7;
} __USBE5TXAbits_t;
extern volatile __USBE5TXAbits_t USBE5TXAbits __asm__ ("USBE5TXA") __attribute__((section("sfrs"), address(0xBF8E30A8)));
#define USBE5RXA USBE5RXA
extern volatile uint32_t   USBE5RXA __attribute__((section("sfrs"), address(0xBF8E30AC)));
typedef struct {
  uint32_t RXFADDR:7;
  uint32_t :9;
  uint32_t RXHUBADD:7;
  uint32_t MULTTRAN:1;
  uint32_t RXHUBPRT:7;
} __USBE5RXAbits_t;
extern volatile __USBE5RXAbits_t USBE5RXAbits __asm__ ("USBE5RXA") __attribute__((section("sfrs"), address(0xBF8E30AC)));
#define USBE6TXA USBE6TXA
extern volatile uint32_t   USBE6TXA __attribute__((section("sfrs"), address(0xBF8E30B0)));
typedef struct {
  uint32_t TXFADDR:7;
  uint32_t :9;
  uint32_t TXHUBADD:7;
  uint32_t MULTTRAN:1;
  uint32_t TXHUBPRT:7;
} __USBE6TXAbits_t;
extern volatile __USBE6TXAbits_t USBE6TXAbits __asm__ ("USBE6TXA") __attribute__((section("sfrs"), address(0xBF8E30B0)));
#define USBE6RXA USBE6RXA
extern volatile uint32_t   USBE6RXA __attribute__((section("sfrs"), address(0xBF8E30B4)));
typedef struct {
  uint32_t RXFADDR:7;
  uint32_t :9;
  uint32_t RXHUBADD:7;
  uint32_t MULTTRAN:1;
  uint32_t RXHUBPRT:7;
} __USBE6RXAbits_t;
extern volatile __USBE6RXAbits_t USBE6RXAbits __asm__ ("USBE6RXA") __attribute__((section("sfrs"), address(0xBF8E30B4)));
#define USBE7TXA USBE7TXA
extern volatile uint32_t   USBE7TXA __attribute__((section("sfrs"), address(0xBF8E30B8)));
typedef struct {
  uint32_t TXFADDR:7;
  uint32_t :9;
  uint32_t TXHUBADD:7;
  uint32_t MULTTRAN:1;
  uint32_t TXHUBPRT:7;
} __USBE7TXAbits_t;
