MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048EFH124/mcu.h
#define __ICDCON_DMTBKEN_POSITION                0x00000005
#define __ICDCON_DMTBKEN_MASK                    0x00000020
#define __ICDCON_DMTBKEN_LENGTH                  0x00000001

#define __ICDCON_DMTEN_POSITION                  0x00000006
#define __ICDCON_DMTEN_MASK                      0x00000040
#define __ICDCON_DMTEN_LENGTH                    0x00000001

#define __ICDCON_FRZ_POSITION                    0x0000000E
#define __ICDCON_FRZ_MASK                        0x00004000
#define __ICDCON_FRZ_LENGTH                      0x00000001

#define __ICDSTAT_CKSWBF_POSITION                0x00000000
#define __ICDSTAT_CKSWBF_MASK                    0x00000001
#define __ICDSTAT_CKSWBF_LENGTH                  0x00000001

#define __ICDSTAT_SLPBF_POSITION                 0x00000001
#define __ICDSTAT_SLPBF_MASK                     0x00000002
#define __ICDSTAT_SLPBF_LENGTH                   0x00000001

#define __ICDSTAT_WDTBF_POSITION                 0x00000002
#define __ICDSTAT_WDTBF_MASK                     0x00000004
#define __ICDSTAT_WDTBF_LENGTH                   0x00000001

#define __ICDSTAT_DMTBF_POSITION                 0x00000003
#define __ICDSTAT_DMTBF_MASK                     0x00000008
#define __ICDSTAT_DMTBF_LENGTH                   0x00000001

#define _OSCCON_OSWEN_POSITION                   0x00000000
#define _OSCCON_OSWEN_MASK                       0x00000001
#define _OSCCON_OSWEN_LENGTH                     0x00000001

#define _OSCCON_SOSCEN_POSITION                  0x00000001
#define _OSCCON_SOSCEN_MASK                      0x00000002
#define _OSCCON_SOSCEN_LENGTH                    0x00000001

#define _OSCCON_CF_POSITION                      0x00000003
#define _OSCCON_CF_MASK                          0x00000008
#define _OSCCON_CF_LENGTH                        0x00000001

#define _OSCCON_SLPEN_POSITION                   0x00000004
#define _OSCCON_SLPEN_MASK                       0x00000010
#define _OSCCON_SLPEN_LENGTH                     0x00000001

#define _OSCCON_CLKLOCK_POSITION                 0x00000007
#define _OSCCON_CLKLOCK_MASK                     0x00000080
#define _OSCCON_CLKLOCK_LENGTH                   0x00000001

#define _OSCCON_NOSC_POSITION                    0x00000008
#define _OSCCON_NOSC_MASK                        0x00000700
#define _OSCCON_NOSC_LENGTH                      0x00000003

#define _OSCCON_COSC_POSITION                    0x0000000C
#define _OSCCON_COSC_MASK                        0x00007000
#define _OSCCON_COSC_LENGTH                      0x00000003

#define _OSCCON_SLP2SPD_POSITION                 0x00000015
#define _OSCCON_SLP2SPD_MASK                     0x00200000
#define _OSCCON_SLP2SPD_LENGTH                   0x00000001

#define _OSCCON_DRMEN_POSITION                   0x00000017
#define _OSCCON_DRMEN_MASK                       0x00800000
#define _OSCCON_DRMEN_LENGTH                     0x00000001

#define _OSCCON_FRCDIV_POSITION                  0x00000018
#define _OSCCON_FRCDIV_MASK                      0x07000000
#define _OSCCON_FRCDIV_LENGTH                    0x00000003

#define _OSCTUN_TUN_POSITION                     0x00000000
#define _OSCTUN_TUN_MASK                         0x0000003F
#define _OSCTUN_TUN_LENGTH                       0x00000006

#define _SPLLCON_PLLRANGE_POSITION               0x00000000
#define _SPLLCON_PLLRANGE_MASK                   0x00000007
#define _SPLLCON_PLLRANGE_LENGTH                 0x00000003

#define _SPLLCON_PLLICLK_POSITION                0x00000007
#define _SPLLCON_PLLICLK_MASK                    0x00000080
#define _SPLLCON_PLLICLK_LENGTH                  0x00000001

#define _SPLLCON_PLLIDIV_POSITION                0x00000008
#define _SPLLCON_PLLIDIV_MASK                    0x00000700
#define _SPLLCON_PLLIDIV_LENGTH                  0x00000003

#define _SPLLCON_PLLMULT_POSITION                0x00000010
#define _SPLLCON_PLLMULT_MASK                    0x007F0000
#define _SPLLCON_PLLMULT_LENGTH                  0x00000007

#define _SPLLCON_PLLODIV_POSITION                0x00000018
#define _SPLLCON_PLLODIV_MASK                    0x07000000
#define _SPLLCON_PLLODIV_LENGTH                  0x00000003

#define _RCON_POR_POSITION                       0x00000000
#define _RCON_POR_MASK                           0x00000001
#define _RCON_POR_LENGTH                         0x00000001

#define _RCON_BOR_POSITION                       0x00000001
#define _RCON_BOR_MASK                           0x00000002
#define _RCON_BOR_LENGTH                         0x00000001

#define _RCON_IDLE_POSITION                      0x00000002
#define _RCON_IDLE_MASK                          0x00000004
#define _RCON_IDLE_LENGTH                        0x00000001

#define _RCON_SLEEP_POSITION                     0x00000003
#define _RCON_SLEEP_MASK                         0x00000008
#define _RCON_SLEEP_LENGTH                       0x00000001

#define _RCON_WDTO_POSITION                      0x00000004
#define _RCON_WDTO_MASK                          0x00000010
#define _RCON_WDTO_LENGTH                        0x00000001

#define _RCON_DMTO_POSITION                      0x00000005
#define _RCON_DMTO_MASK                          0x00000020
#define _RCON_DMTO_LENGTH                        0x00000001

#define _RCON_SWR_POSITION                       0x00000006
#define _RCON_SWR_MASK                           0x00000040
#define _RCON_SWR_LENGTH                         0x00000001

#define _RCON_EXTR_POSITION                      0x00000007
#define _RCON_EXTR_MASK                          0x00000080
#define _RCON_EXTR_LENGTH                        0x00000001

#define _RCON_CMR_POSITION                       0x00000009
#define _RCON_CMR_MASK                           0x00000200
#define _RCON_CMR_LENGTH                         0x00000001

#define _RCON_BCFGFAIL_POSITION                  0x0000001A
#define _RCON_BCFGFAIL_MASK                      0x04000000
#define _RCON_BCFGFAIL_LENGTH                    0x00000001

#define _RCON_BCFGERR_POSITION                   0x0000001B
#define _RCON_BCFGERR_MASK                       0x08000000
#define _RCON_BCFGERR_LENGTH                     0x00000001

#define _RSWRST_SWRST_POSITION                   0x00000000
#define _RSWRST_SWRST_MASK                       0x00000001
#define _RSWRST_SWRST_LENGTH                     0x00000001

#define _RNMICON_NMICNT_POSITION                 0x00000000
#define _RNMICON_NMICNT_MASK                     0x0000FFFF
#define _RNMICON_NMICNT_LENGTH                   0x00000010

